thinflatplate_30_cfmesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
flatplate
{
    type wall;
    nFaces 6232;
    startFace 279675;
}

outlet
{
    type patch;
    nFaces 484;
    startFace 285907;
}

inlet
{
    type patch;
    nFaces 484;
    startFace 286391;
}

sidewall
{
    type wall;
    nFaces 1848;
    startFace 286875;
}

upperwall
{
    type wall;
    nFaces 924;
    startFace 288723;
}

lowerwall
{
    type patch;
    nFaces 924;
    startFace 289647;
}

)


// ************************************************************************* //
