thinflatplate_30_cfmesh/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1.0 0 0);

boundaryField
{


    inlet
    {
      type            fixedValue;
      value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    sidewall
    {
        type            noSlip;
    }

    upperwall
    {
        type            noSlip;
    }

    lowerwall
    {
        type            noSlip;
    }

    flatplate
    {
        type            noSlip;

    }


}


// ************************************************************************* //
